import streamlit as st

st.markdown(
   """"في سياق التطورات الاقتصادية والاجتماعية التي تشهدها المملكة، أصبحت دراسة سوق العمل والتوجهات الحالية فيه أمرًا بالغ الأهمية. يساعد فهم هذه الديناميكيات في توجيه السياسات والبرامج التعليمية لتلبية احتياجات السوق. من خلال تحليل بيانات الوظائف المعلن عنها، نسعى للإجابة على مجموعة من الأسئلة الأساسية التي تسلط الضوء على طبيعة سوق العمل في المملكة.

سنتناول أولاً نسبة الوظائف المعلن عنها لكل منطقة، مما يتيح لنا فهم توزيع الفرص الوظيفية على مستوى المملكة. ثم، سنبحث في مسألة التفضيل الجنساني في هذه الوظائف، لفهم مدى انفتاح السوق على جميع الأفراد. بعد ذلك، سنستعرض النطاق المتوقع للراتب للخريجين الجدد، مما يسهم في توجيه توقعاتهم وأهدافهم المهنية. وأخيرًا، سنتحقق مما إذا كانت فرص العمل تستهدف بشكل أساسي الأفراد ذوي الخبرة أم أن هناك مساحات متاحة للخريجين الجدد.

من خلال هذه الأسئلة، نهدف إلى تقديم رؤى شاملة تساعد الخريجين والمهنيين في اتخاذ قرارات مستنيرة حول مستقبلهم المهني.
"""
    
)


st.header("ما هي نسبة الوظائف المعلن عنها لكل منطقة في المملكة؟ ")
st.image("chart_1.png")
st.write("نلاحظ ان اكثر اعلانات الوظائف في مدينة الرياض وتمثل 42.4% مقارنة بالمدن الاخرى")



st.header("هل هناك تفضيل بنين الجنسين في الوظائف المعلن عنها؟")
st.image("chart_2.png")
st.write("الوظائف للذكور 455 والاناث 390 لايوجد فرق كبير ")


st.header("ما هو النطاق المتوقع للراتب للخريجين الجدد؟")
st.image("chart_3.png")
st.write("تبدأ رواتب الخريجين الجدد من 3000 وتصل حتى 13000 ولكن اغلب الرواتب من 4000-4900")


st.header("هل تستهدف فرص العمل بشكل أساسي الأفراد ذوي الخبرة، أم أن هناك مجالًا للخريجين الجدد أيضًا؟")
st.image("chart_4.png")
st.write("نلاحظ ان اكثر اعلانات الوظائف للخرجين الجدد والذين ليست لديهم خبرة")
