pip install matplotlib
import streamlit as st
import matplotlib.pyplot as plt
st.markdown(
   """"في سياق التطورات الاقتصادية والاجتماعية التي تشهدها المملكة، أصبحت دراسة سوق العمل والتوجهات الحالية فيه أمرًا بالغ الأهمية. يساعد فهم هذه الديناميكيات في توجيه السياسات والبرامج التعليمية لتلبية احتياجات السوق. من خلال تحليل بيانات الوظائف المعلن عنها، نسعى للإجابة على مجموعة من الأسئلة الأساسية التي تسلط الضوء على طبيعة سوق العمل في المملكة.

سنتناول أولاً نسبة الوظائف المعلن عنها لكل منطقة، مما يتيح لنا فهم توزيع الفرص الوظيفية على مستوى المملكة. ثم، سنبحث في مسألة التفضيل الجنساني في هذه الوظائف، لفهم مدى انفتاح السوق على جميع الأفراد. بعد ذلك، سنستعرض النطاق المتوقع للراتب للخريجين الجدد، مما يسهم في توجيه توقعاتهم وأهدافهم المهنية. وأخيرًا، سنتحقق مما إذا كانت فرص العمل تستهدف بشكل أساسي الأفراد ذوي الخبرة أم أن هناك مساحات متاحة للخريجين الجدد.

من خلال هذه الأسئلة، نهدف إلى تقديم رؤى شاملة تساعد الخريجين والمهنيين في اتخاذ قرارات مستنيرة حول مستقبلهم المهني.
"""
    
)


st.header("1.اعلانات الوظائف لكل منطقة")

